uhnp/src/InformationRegisters/СоответствиеЗаявокНаИзменениеНСИ/СоответствиеЗаявокНаИзменениеНСИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствиеЗаявокНаИзменениеНСИ</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияСогласования</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьОшибкиОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнформацияОбОшибке</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОбменВыполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяПередачаСтатуса</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ЗаявкаДочерняяБазаНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаДочерняяБазаДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаЦентральнаяБазаНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаЦентральнаяБазаДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦентрализованнаяБазаНСИ</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаРодитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДочерняяБаза</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаявкаДочерняяБаза</name>
    <type>
      <types>DocumentRef.ЗаявкаНаИзменениеНСИ</types>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаявкаЦентральнаяБаза</name>
    <type>
      <types>DocumentRef.ЗаявкаНаИзменениеНСИ</types>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ТипыКонтроляНСИ/ТипыКонтроляНСИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтроляНСИ</name>
  <enumValues>
    <name>НеКонтролируется</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкиНаИзменениеНСИ</name>
  </enumValues>
  <enumValues>
    <name>ИзмененияЗапрещены</name>
  </enumValues>
  <enumValues>
    <name>ПроверятьЗаполнениеРеквизитов</name>
  </enumValues>
  <enumValues>
    <name>ИзмененияПоВерсиям</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыОперацийИзмененияНСИ/ВидыОперацийИзмененияНСИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийИзмененияНСИ</name>
  <enumValues>
    <name>РегистрацияНовогоОбъекта</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеРеквизитовОбъекта</name>
  </enumValues>
  <enumValues>
    <name>УдалениеОбъекта</name>
  </enumValues>
  <enumValues>
    <name>УдалениеДубликатаОбъекта</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СпособыСогласованияСвязанныхОбъектов/СпособыСогласованияСвязанныхОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыСогласованияСвязанныхОбъектов</name>
  <enumValues>
    <name>НеСогласовывать</name>
  </enumValues>
  <enumValues>
    <name>СогласовыватьСинхронно</name>
  </enumValues>
  <enumValues>
    <name>СогласовыватьОтдельно</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СостоянияСогласования/СостоянияСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСогласования</name>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
  <enumValues>
    <name>Рассматривается</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Возвращена</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНаОплате</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОплачено</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНеактивен</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/ЗаявкаНаИзменениеНСИ/ЗаявкаНаИзменениеНСИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаИзменениеНСИ</name>
  <posting>Deny</posting>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийИзмененияНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменяемыйОбъект</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбразцовыйОбъект</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаКонсолидации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочникБД</name>
    <type>
      <types>CatalogRef.СправочникиБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДочерняяБаза</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзменениеРеквизитов</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсходноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НовоеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзменениеТЧ</name>
    <attributes>
      <name>ТабличнаяЧасть</name>
      <type>
        <types>CatalogRef.ТабличныеЧастиБД</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсходноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НовоеЗначение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзменениеДополнительныхРеквизитов</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходноеЗначение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходнаяТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НовоеЗначение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>НоваяТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзменениеДополнительныхСведений</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходноеЗначение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>НовоеЗначение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаявкиНаИзменениеСвязанныхОбъектов</name>
    <attributes>
      <name>ЗаявкаНаСвязанныйОбъект</name>
      <type>
        <types>DocumentRef.ЗаявкаНаИзменениеНСИ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Catalogs/ТипыБазДанных/ТипыБазДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыБазДанных</name>
  <predefined>
    <items>
      <name>ТекущаяИБ</name>
      <description>Текущая информационная база</description>
    </items>
    <items>
      <name>ОбменТаблДок</name>
      <description>Файлы Microsoft Excel</description>
    </items>
  </predefined>
  <attributes>
    <name>ВИБПоУмолчанию</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>EnumRef.ПлатформыВнешнихИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПоУмолчанию</name>
    <comment>Если при сопоставлении получено пустое значение валюты, тогда подставить значение валюты по умолчанию</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменДаннымиРегламентнымЗаданием</name>
    <comment>Выполнять данными контроля НСИ регламентным заданием</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьНСИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуютсяПланыОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеВидовСубконто</name>
    <attributes>
      <name>ВидСубконтоИБ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАналитики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ТабличныеЧастиБД/ТабличныеЧастиБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТабличныеЧастиБД</name>
  <owners>Catalog.СправочникиБД</owners>
  <owners>Catalog.ДокументыБД</owners>
  <owners>Catalog.ПланыВидовХарактеристикБД</owners>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАналитики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПримитивногоТипа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/CommonModules/УправлениеФормойНСИСервер/Module.bsl
Функция ДанныеКонтроляНСИ(ОбъектСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураКонтроля=Новый Структура;
	СтруктураКонтроля.Вставить("КонтролироватьНСИ",Ложь);
	СтруктураКонтроля.Вставить("ТребуетсяСогласование",Ложь);
	СтруктураКонтроля.Вставить("СуществующийОбъект",Ложь);
	СтруктураКонтроля.Вставить("ЦентрализованнаяБазаНСИ",Ложь);
	СтруктураКонтроля.Вставить("ИзмененияЗапрещены",Ложь);
	СтруктураКонтроля.Вставить("ЗаявкиНаИзменениеНСИ",Ложь);
	СтруктураКонтроля.Вставить("ВыборНеАктивных",Ложь);
	
	УправлятьНСИ = ПолучитьФункциональнуюОпцию("УправлениеНСИ");
	
	Если НЕ УправлятьНСИ Тогда
		Возврат СтруктураКонтроля;
	КонецЕсли; 
		
	МетаданныеОбъекта=ОбъектСсылка.Метаданные();	
	ИмяОбъекта=МетаданныеОбъекта.Имя;

	ОписаниеОбъекта = УправлениеНСИ.ПолучитьДанныеОбъектаНСИ(ИмяОбъекта);
	
	Если ОписаниеОбъекта=Неопределено ИЛИ (ОписаниеОбъекта.ТипКонтроляНСИ=Перечисления.ТипыКонтроляНСИ.НеКонтролируется) Тогда
		
		Возврат СтруктураКонтроля;  
		
	Иначе
		
		СтруктураКонтроля.Вставить("КонтролироватьНСИ",Истина);
		СтруктураКонтроля.Вставить("ИзмененияЗапрещены",ОписаниеОбъекта.ТипКонтроляНСИ=Перечисления.ТипыКонтроляНСИ.ИзмененияЗапрещены);
		СтруктураКонтроля.Вставить("Наименование",ОписаниеОбъекта.Наименование);
		СтруктураКонтроля.Вставить("ЦентрализованнаяБазаНСИ",ОписаниеОбъекта.ЦентрализованнаяБазаНСИ);
		СтруктураКонтроля.Вставить("ЗаявкиНаИзменениеНСИ",ОписаниеОбъекта.ТипКонтроляНСИ=Перечисления.ТипыКонтроляНСИ.ЗаявкиНаИзменениеНСИ);
		СтруктураКонтроля.Вставить("ВыборНеАктивных",ОписаниеОбъекта.ВыборНеАктивных);
		СтруктураКонтроля.Вставить("Синоним",МетаданныеОбъекта.Синоним);
		
	КонецЕсли; 

	Если ОписаниеОбъекта.ТипКонтроляНСИ=Перечисления.ТипыКонтроляНСИ.ЗаявкиНаИзменениеНСИ Тогда
		
		СтруктураКонтроля.Вставить("ЗаявкиНаИзменениеНСИ",Истина);
		
		Если ЗначениеЗаполнено(ОписаниеОбъекта.ЦентрализованнаяБазаНСИ) Тогда
			
			СтруктураКонтроля.Вставить("ТребуетсяСогласование",Истина);
									
		Иначе
			
			МодульУправлениеОтчетами=Метаданные.ОбщиеМодули.Найти("УправлениеОтчетамиУХ");
			
			Если МодульУправлениеОтчетами=Неопределено Тогда
				
				СтруктураКонтроля.Вставить("ТребуетсяСогласование",Ложь);
				
			Иначе
				
				ТекущийПользователь = Пользователи.АвторизованныйПользователь();
				
				РабочийМодуль=ОбщегоНазначения.ОбщийМодуль("УправлениеОтчетамиУХ");
				
				Согласующие = РабочийМодуль.ПолучитьОтветственногоЗаТипОбъекта(Документы.ЗаявкаНаИзменениеНСИ.ПустаяСсылка(),Неопределено,ОписаниеОбъекта.Ссылка,"Согласующий", Истина);
				
				СтруктураКонтроля.Вставить("ТребуетсяСогласование",Согласующие.Найти(ТекущийПользователь) = Неопределено);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураКонтроля.Вставить("СуществующийОбъект",ЗначениеЗаполнено(ОбъектСсылка));
	
	Возврат СтруктураКонтроля;
	
КонецФункции // ТребуетсяСогласование(Форма)

Функция ВнешнееУправлениеНСИ(Ссылка) Экспорт
	
	МетаданныеОбъекта=Ссылка.Метаданные();	
	ИмяОбъекта=МетаданныеОбъекта.Имя;

	ОписаниеОбъекта = УправлениеНСИ.ПолучитьДанныеОбъектаНСИ(ИмяОбъекта);
	
	Если ОписаниеОбъекта=Неопределено Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
			
	Если НЕ ОписаниеОбъекта.ЕстьРеквизитыНСИ Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(ОписаниеОбъекта.ЦентрализованнаяБазаНСИ);
	
КонецФункции // ВнешнееУправлениеНСИ()

Функция ВозможноИзменениеОбъекта(СтруктураКонтроля) Экспорт
	
    Возврат НЕ СтруктураКонтроля.ИзмененияЗапрещены;
	
КонецФункции // ВозможноРедактированиеОбъекта() 

Процедура ДобавитьЭлементыУправленияНСИ(Форма) Экспорт
	
	Объект=Форма.Объект;
	ОбъектСсылка=Форма.Объект.Ссылка;
	
	СтруктураКонтроля=ДанныеКонтроляНСИ(ОбъектСсылка);
	
	Если НЕ СтруктураКонтроля.КонтролироватьНСИ Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект=Форма.Объект;
			
	Если НЕ СтруктураКонтроля.СуществующийОбъект Тогда
		
		Если СтруктураКонтроля.ТребуетсяСогласование Тогда
			
			Если НЕ ВозможноИзменениеОбъекта(СтруктураКонтроля) Тогда
				
				Возврат;
				
			КонецЕсли;
								
			ДобавитьКомандуФормыЦНСИ(Форма,
								"ЦНСИ_ВвестиЗаявкуНаРегистрацию",
								НСтр("ru = 'Ввести заявку на регистрацию элемента'"),
								"ЦНСИ_ВвестиЗаявкуНаРегистрацию_Подключаемый",
								"Утвердить");
			
		КонецЕсли;
		
	Иначе
		
		Если НЕ ВозможноИзменениеОбъекта(СтруктураКонтроля) Тогда
			
			ДобавитьДекорациюЗапретИзменений(Форма,СтруктураКонтроля);
			Форма.ТолькоПросмотр=Истина;
			Возврат;
					
		ИначеЕсли СтруктураКонтроля.ТребуетсяСогласование Тогда
			
			Если Объект.НСИ_НеАктивный Тогда
				
				Заявка = СуществуетРабочаяЗаявка(Объект.Ссылка,Перечисления.ВидыОперацийИзмененияНСИ.РегистрацияНовогоОбъекта);
				
				Если Заявка=Неопределено Тогда
										
					ДобавитьКомандуФормыЦНСИ(Форма,
								"ЦНСИ_ВвестиЗаявкуНаРегистрацию",
								НСтр("ru = 'Ввести заявку на регистрацию элемента'"),
								"ЦНСИ_ВвестиЗаявкуНаРегистрацию_Подключаемый",
								"Утвердить");
					
				Иначе
					
					
					ДобавитьКомандуФормыЦНСИ(Форма,
								"ЦНСИ_ПоказатьАктивнуюЗаявку",
								НСтр("ru = 'Показать заявку на регистрацию элемента'"),
								"ЦНСИ_ПоказатьАктивнуюЗаявку_Подключаемый",
								"Утвердить");
					
				КонецЕсли;
							
				Форма.Заголовок=Форма.Заголовок+" ("+НСтр("ru = 'не активный'")+")";		
							
			Иначе
				
				
				ДобавитьКомандуФормыЦНСИ(Форма,
								"ЦНСИ_ВвестиЗаявкуНаИзменение",
								НСтр("ru = 'Ввести заявку на изменение элемента'"),
								"ЦНСИ_ВвестиЗаявкуНаИзменение_Подключаемый",
								"ПодсистемаСправочникиИНастройкиУчета");
								
			КонецЕсли; 
			
		КонецЕсли;
		
		НарисоватьПанельУправленияЦНСИ(Форма,Объект.НСИ_НеАктивный,СтруктураКонтроля.ТребуетсяСогласование)
				
	КонецЕсли;
	
КонецПроцедуры // НарисоватьПанельУправленияЦНСИ() 

Процедура ДобавитьКомандуФормыЦНСИ(Форма,ИмяКоманды,ЗаголовокКоманды,Обработчик, НаименованиеКартинки = "",ГруппаРодитель=Неопределено) Экспорт
	
	НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
	
	Если НаименованиеКартинки <> "" Тогда
		НоваяКоманда.Картинка = БиблиотекаКартинок[НаименованиеКартинки];
	КонецЕсли;	  
	
	НоваяКоманда.Заголовок 	= ЗаголовокКоманды;
	НоваяКоманда.Подсказка 	= ЗаголовокКоманды;
	НоваяКоманда.Действие	= Обработчик;
	
	ДобавитьЭлементФормыЦНСИ(Форма,ИмяКоманды,ГруппаРодитель);

КонецПроцедуры		// ДобавитьКомандуФормы()

Процедура ДобавитьЭлементФормыЦНСИ(Форма,ИмяКоманды,ГруппаРодитель)
	
	Если ГруппаРодитель=Неопределено Тогда 
		
		АдресДобавления=ОпределитьАдресДобавления(Форма);
		
	Иначе
		
		АдресДобавления=ГруппаРодитель;
		
	КонецЕсли;
	
	Если АдресДобавления.ПодчиненныеЭлементы.Количество()>0 Тогда
		
		ЭлементПодменюНСИ = Форма.Элементы.Вставить(ИмяКоманды, Тип("КнопкаФормы"),АдресДобавления, АдресДобавления.ПодчиненныеЭлементы[0]); 
		
	Иначе
		
		ЭлементПодменюНСИ = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"),АдресДобавления);
		
	КонецЕсли;
		
	ЭлементПодменюНСИ.ИмяКоманды = ИмяКоманды;
	ЭлементПодменюНСИ.Отображение = ОтображениеКнопки.Картинка;
	ЭлементПодменюНСИ.ОтображениеПодсказки = ОтображениеПодсказки.Всплывающая;
	ЭлементПодменюНСИ.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
		
КонецПроцедуры // ДобавитьКомандуЦНСИ()

Процедура ДобавитьДекорациюЗапретИзменений(Форма,СтруктураКонтроля) Экспорт	
	
	АдресДобавления=ОпределитьАдресДобавления(Форма);
	
	НоваяДекорация = Форма.Элементы.Вставить("Декорация_ЗапретНСИ", Тип("ДекорацияФормы"),Форма,АдресДобавления);	
	НоваяДекорация.ЦветТекста=Новый Цвет(255,0,0);
	НоваяДекорация.Шрифт=Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, , , Истина);
	НоваяДекорация.Заголовок=СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Нстр("ru = 'Элементы справочника %1 загружаются из централизованной базы %2. Интерактивное изменение элементов запрещено.'"),СтруктураКонтроля.Наименование,СтруктураКонтроля.ЦентрализованнаяБазаНСИ)			

КонецПроцедуры // ДобавитьДекорациюЦНСИ()

Функция ОпределитьАдресДобавления(Форма) Экспорт
	
	Если Форма.ПоложениеКоманднойПанели=ПоложениеКоманднойПанелиФормы.Нет Тогда
		
		Для Каждого Элемент ИЗ Форма.ПодчиненныеЭлементы Цикл
			
			Если ТипЗнч(Элемент)=Тип("ГруппаФормы") Тогда
				
				Возврат Элемент;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Возврат Форма.КоманднаяПанель;
		
	КонецЕсли;
	
	
КонецФункции // ОпределитьАдресДобавления() 

// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
Процедура НарисоватьПанельУправленияЦНСИ(Форма,НСИ_НеАктивный,ТребуетсяСогласование) Экспорт
	
	ЭлементПодменюНСИ=Форма.Элементы.Найти("НСИ_ПодменюУправлениеНСИ");
	
	Если ЭлементПодменюНСИ=Неопределено Тогда
		
		АдресДобавления=ОпределитьАдресДобавления(Форма);
				
		ЭлементПодменюНСИ = Форма.Элементы.Добавить("НСИ_ПодменюУправлениеНСИ", Тип("ГруппаФормы"), АдресДобавления); // ГруппаФормы
		ЭлементПодменюНСИ.Заголовок = НСтр("ru='Управление ЦНСИ'");
		ЭлементПодменюНСИ.Вид       = ВидГруппыФормы.Подменю;
		ЭлементПодменюНСИ.Картинка  = БиблиотекаКартинок.ПодобратьТовары;
		
	КонецЕсли;
		
	Если ТребуетсяСогласование Тогда
		
		Если НЕ НСИ_НеАктивный Тогда
						
			ДобавитьКомандуФормыЦНСИ(Форма,
								"ЦНСИ_ВвестиЗаявкуНаУдаление",
								НСтр("ru = 'Ввести заявку на удаление элемента'"),
								"ЦНСИ_ВвестиЗаявкуНаУдаление_Подключаемый",
								"ПользовательскийМакетУдалить",
								ЭлементПодменюНСИ);
			
			
		КонецЕсли;
							
		ДобавитьКомандуФормыЦНСИ(Форма,
								"ЦНСИ_ВвестиЗаявкуНаУдалениеДубликата",
								НСтр("ru = 'Ввести заявку на удаление дублирующего элемента'"),
								"ЦНСИ_ВвестиЗаявкуНаУдалениеДубликата_Подключаемый",
								"ПользовательскийМакетУдалить",
								ЭлементПодменюНСИ);
					
		
	КонецЕсли; 
	
	ДобавитьКомандуФормыЦНСИ(Форма,
								"ЦНСИ_ОткрытьСписокЗаявокНаИзменение",
								НСтр("ru = 'Открыть список заявок на изменение элемента'"),
								"ЦНСИ_ОткрытьСписокЗаявокНаИзменение_Подключаемый",
								"УстановитьФлажки",
								ЭлементПодменюНСИ);
								
	ДобавитьКомандуФормыЦНСИ(Форма,
								"ЦНСИ_ПоказатьРеквизитыЦНСИ",
								НСтр("ru = 'Показать реквизиты ЦНСИ'"),
								"ЦНСИ_ПоказатьРеквизитыЦНСИ_Подключаемый",
								"Ресурс",
								ЭлементПодменюНСИ);
	
			
КонецПроцедуры // НарисоватьПанельУправленияЦНСИ()

Процедура ОтобразитьИзмененияОбъекта(Форма,АдресХранилищаИзменений) Экспорт

	ДанныеИзменения=ПолучитьИзВременногоХранилища(АдресХранилищаИзменений);
	ВидОперации=ДанныеИзменения.ВидОперации;
		
	Если ДанныеИзменения.Свойство("ИзменениеРеквизитов") Тогда
		
		ОтобразитьИзмененияШапки(Форма,ДанныеИзменения.ИзменениеРеквизитов,ВидОперации);
		
	КонецЕсли;
	
	Если ДанныеИзменения.Свойство("ИзменениеТЧ") Тогда 
		
		Для Каждого СтрокаТЧ ИЗ ДанныеИзменения.ИзменениеТЧ Цикл 
			
			ИмяТЧ=ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.ТабличнаяЧасть,"Имя");
			
			Если ИмяТЧ="КонтактнаяИнформация" Тогда
				
				ОтобразитьИзменениеКонтактнойИнформации(Форма,СтрокаТЧ,ВидОперации);
				
			ИначеЕсли ИмяТЧ="ДополнительныеРеквизиты" Тогда
				
				ОтобразитьИзменениеДополнительныхРеквизитов(Форма,СтрокаТЧ,ВидОперации);
				
			Иначе
				
				ОтобразитьИзмененияТЧ(Форма,СтрокаТЧ,ВидОперации);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Форма.ТолькоПросмотр=Истина;

КонецПроцедуры // ОтобразитьИзмененияОбъекта() 

Функция ПолучитьОписаниеРеквизитовОбъекта(Ссылка) Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СправочникиБДРеквизиты.Имя КАК Имя,
	|	СправочникиБДРеквизиты.Синоним КАК Синоним
	|ИЗ
	|	Справочник.СправочникиБД.Реквизиты КАК СправочникиБДРеквизиты
	|ГДЕ
	|	СправочникиБДРеквизиты.Ссылка.Владелец = ЗНАЧЕНИЕ(Справочник.ТипыБазДанных.ТекущаяИБ)
	|	И СправочникиБДРеквизиты.Ссылка.Наименование = &Наименование"; 
	
	Запрос.УстановитьПараметр("Наименование",Ссылка.Метаданные().Имя);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции // ПолучитьОписаниеРеквизитовОбъекта() 

Процедура ОтобразитьИзмененияШапки(Форма,ИзменениеРеквизитов,ВидОперации) Экспорт
	
	РеквизитыОбъекта = ПолучитьОписаниеРеквизитовОбъекта(Форма.Объект.Ссылка);
	
	ТаблицаЭлементов=Новый ТаблицаЗначений;	
	ТаблицаЭлементов.Колонки.Добавить("Элемент");
	ТаблицаЭлементов.Колонки.Добавить("Заголовок");
	ТаблицаЭлементов.Колонки.Добавить("НовоеЗначение");
	ТаблицаЭлементов.Колонки.Добавить("ПутьКДанным");
	
	РеквизитыКДобавлению=Новый Массив;
	МассивДобавленных=Новый Массив;
		
	Для Каждого Элемент ИЗ Форма.Элементы Цикл
		
		Если НЕ ТипЗнч(Элемент) = Тип("ПолеФормы") тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрНайти(Элемент.ПутьКДанным,"Объект.")=0 Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ИмяРеквизита=СтрЗаменить(Элемент.ПутьКДанным,"Объект.","");
		
		СтрИзменение=ИзменениеРеквизитов.Найти(ИмяРеквизита,"ИмяРеквизита");
		
		Если СтрИзменение=Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ДанныеРеквизита=РеквизитыОбъекта.Найти(ИмяРеквизита,"Имя");
				
		Если Не ЗначениеЗаполнено(Элемент.Заголовок) Тогда
				
			ЗаголовокЭлемента=ДанныеРеквизита.Синоним;
			
		Иначе
			
			ЗаголовокЭлемента=Элемент.Заголовок;
			
		КонецЕсли; 
		
		Если МассивДобавленных.Найти(ИмяРеквизита)=Неопределено Тогда
			
			МассивТипов=Новый Массив;
			МассивТипов.Добавить(ТипЗнч(СтрИзменение.НовоеЗначение));
			
			РеквизитыКДобавлению.Добавить(Новый РеквизитФормы("New_"+ИмяРеквизита,Новый ОписаниеТипов(МассивТипов)));
			
			МассивДобавленных.Добавить(ИмяРеквизита);
			
		КонецЕсли;
	
		НоваяСтрока=ТаблицаЭлементов.Добавить();
		НоваяСтрока.Элемент=Элемент;
		НоваяСтрока.Заголовок=ЗаголовокЭлемента;
		НоваяСтрока.НовоеЗначение=СтрИзменение.НовоеЗначение;
		НоваяСтрока.ПутьКДанным="New_"+ИмяРеквизита; 
					
	КонецЦикла; 
	
	Форма.ИзменитьРеквизиты(РеквизитыКДобавлению);
	
	ТекстСравнения=?(ВидОперации=Перечисления.ВидыОперацийИзмененияНСИ.ИзменениеРеквизитовОбъекта,Нстр("ru = ' (новый)'"),Нстр("ru = ' (эталон)'"));
	
	ОтобразитьИзменениеЭлементов(Форма,ТаблицаЭлементов,ТекстСравнения);
		
КонецПроцедуры // ОтобразитьИзмененияШапки() 

// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
Процедура ОтобразитьИзменениеЭлементов(Форма,ТаблицаЭлементов,ТекстСравнения) Экспорт
	
	Для Каждого ДанныеЭлементов ИЗ ТаблицаЭлементов Цикл
		
		ЭлементФормы=ДанныеЭлементов.Элемент;
		Форма[ДанныеЭлементов.ПутьКДанным]=ДанныеЭлементов.НовоеЗначение;
		
		НоваяГруппа=Форма.Элементы.Вставить("New_"+ЭлементФормы.Имя+"_Группа",Тип("ГруппаФормы"),ЭлементФормы.Родитель,ЭлементФормы); // ГруппаФормы
		НоваяГруппа.Вид=ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.Группировка=ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		НоваяГруппа.Отображение=ОтображениеОбычнойГруппы.Нет;
		НоваяГруппа.ОтображатьЗаголовок=Ложь;
		
		
		НовыйЭлемент=Форма.Элементы.Вставить("New_"+ЭлементФормы.Имя,Тип("ПолеФормы"),НоваяГруппа); // ПолеФормы
		НовыйЭлемент.ПутьКДанным=ДанныеЭлементов.ПутьКДанным;
		НовыйЭлемент.Вид=ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлемент.ТолькоПросмотр=Истина;
		
		НоваяДекорация=Форма.Элементы.Вставить("New_"+ЭлементФормы.Имя+"_Декорация",Тип("ДекорацияФормы"),НоваяГруппа,НовыйЭлемент);
		НоваяДекорация.ЦветФона=WebЦвета.Розовый;	
		НоваяДекорация.Заголовок=СтрШаблон(Нстр("ru = '%1 %2'"),ДанныеЭлементов.Заголовок,ТекстСравнения);
						
		ЭлементФормы.Заголовок=СтрШаблон(Нстр("ru = '%1 (текущий)'"),ДанныеЭлементов.Заголовок);
		
		ОтобразитьИзменениеГруппыРодителя(ЭлементФормы.Родитель);
		
	КонецЦикла;
	
КонецПроцедуры // ОтобразитьИзменениеЭлементов() 

Функция ПолучитьОписаниеРеквизитовТЧ(ТабличнаяЧасть)

	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ТабличныеЧастиБДРеквизиты.Имя КАК Имя,
	|	ТабличныеЧастиБДРеквизиты.Синоним КАК Синоним,
	|	ТабличныеЧастиБДРеквизиты.ТипДанных КАК ТипДанных
	|ИЗ
	|	Справочник.ТабличныеЧастиБД.Реквизиты КАК ТабличныеЧастиБДРеквизиты
	|ГДЕ
	|	ТабличныеЧастиБДРеквизиты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",ТабличнаяЧасть);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьОписаниеРеквизитовТЧ() 

// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
Процедура ОтобразитьИзмененияТЧ(Форма,СтрокаТЧ,ВидОперации) Экспорт
	
	РеквизитыТЧ = ПолучитьОписаниеРеквизитовТЧ(СтрокаТЧ.ТабличнаяЧасть);
	ДанныеТЧ=ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТЧ.ТабличнаяЧасть,"Имя,Синоним");
	ИмяТЧ=ДанныеТЧ.Имя;
	ЭлементТЧ_Стар=Неопределено;
	ИмяРеквизитаТЧ="New_"+ИмяТЧ;
		
	РеквизитыКДобавлению=Новый Массив; 
	ТипБулево=РаботаСОбъектамиМетаданныхВнешнийУХ.ПолучитьОписаниеТиповБулево();
		
	Для Каждого Элемент ИЗ Форма.Элементы Цикл
		
		Если НЕ ТипЗнч(Элемент) = Тип("ТаблицаФормы") тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрНайти(Элемент.ПутьКДанным,"Объект.")=0 Тогда
			
			Продолжить;
			
		КонецЕсли;
				
		Если СтрЗаменить(Элемент.ПутьКДанным,"Объект.","")=ИмяТЧ Тогда
			
			ЭлементТЧ_Стар=Элемент;
			Прервать;
			
		КонецЕсли;
								
	КонецЦикла;
	
	РеквизитыКДобавлению=Новый Массив;
	
	РеквизитыКДобавлению.Добавить(Новый РеквизитФормы(ИмяРеквизитаТЧ,
							Новый ОписаниеТипов("ТаблицаЗначений"),,,Истина));
							
	Форма.ИзменитьРеквизиты(РеквизитыКДобавлению);
	РеквизитыКДобавлению=Новый Массив;
	
	РеквизитыКДобавлению.Добавить(Новый РеквизитФормы("НомерСтроки",РаботаСОбъектамиМетаданныхВнешнийУХ.ПолучитьОписаниеТиповЧисла(5),ИмяРеквизитаТЧ,НСтр("ru = 'Номер строки'"),Истина));
	
	Для Каждого СтрРеквизит ИЗ РеквизитыТЧ Цикл
		
		Если СтрРеквизит.Имя="Ссылка" Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		РеквизитыКДобавлению.Добавить(Новый РеквизитФормы(СтрРеквизит.Имя,РаботаСОбъектамиМетаданныхВнешнийУХ.ПолучитьОписаниеТиповИзСтрокиТипов(СтрРеквизит.ТипДанных),ИмяРеквизитаТЧ,СтрРеквизит.Синоним,Истина));

	КонецЦикла;
	
	Форма.ИзменитьРеквизиты(РеквизитыКДобавлению);
	
	НоваяТЧ=СтрокаТЧ.НовоеЗначение.Получить();
	
	Для Каждого СтрокаТЧ ИЗ НоваяТЧ Цикл
		
		НоваяСтрока=Форма[ИмяРеквизитаТЧ].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);
		
	КонецЦикла;
	
	Если ЭлементТЧ_Стар=Неопределено Тогда
		
		ЭлементТЧ_Стар=ПолучитьЭлементТЧ_Стар(Форма,ДанныеТЧ,РеквизитыТЧ);
		
	КонецЕсли;
	
	НоваяГруппа=Форма.Элементы.Вставить(ИмяРеквизитаТЧ+"_Группа",Тип("ГруппаФормы"),ЭлементТЧ_Стар.Родитель,ЭлементТЧ_Стар); // ГруппаФормы
	НоваяГруппа.Вид=ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Группировка=ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НоваяГруппа.Отображение=ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок=Ложь;
	
	НоваяТЧ=Форма.Элементы.Добавить(ИмяРеквизитаТЧ,Тип("ТаблицаФормы"),НоваяГруппа);
	НоваяТЧ.ПутьКДанным=ИмяРеквизитаТЧ;
	НоваяТЧ.КоманднаяПанель.Видимость=Ложь;
	
	Для Каждого ЭлементТЧ ИЗ ЭлементТЧ_Стар.ПодчиненныеЭлементы Цикл
		
		ИмяКолонки=СтрЗаменить(ЭлементТЧ.ПутьКДанным,"Объект."+ИмяТЧ+".",""); 
				
		НоваяКолонка=Форма.Элементы.Добавить(ИмяТЧ+"_"+ИмяКолонки+"_Нов",Тип("ПолеФормы"),НоваяТЧ); // ПолеФормы
		НоваяКолонка.ПутьКДанным=ИмяРеквизитаТЧ+"."+ИмяКолонки;
		НоваяКолонка.Заголовок=ЭлементТЧ.Заголовок;
		НоваяКолонка.Вид=ЭлементТЧ.Вид;
		НоваяКолонка.ТолькоПросмотр=Истина;
		
	КонецЦикла;
	
	ТекстСравнения=?(ВидОперации=Перечисления.ВидыОперацийИзмененияНСИ.ИзменениеРеквизитовОбъекта,Нстр("ru = ' (новая)'"),Нстр("ru = ' (эталон)'"));

	
	НоваяДекорация=Форма.Элементы.Вставить(ИмяТЧ+"_Декорация",Тип("ДекорацияФормы"),НоваяГруппа,НоваяТЧ);
	НоваяДекорация.ЦветФона=WebЦвета.Розовый;	
	НоваяДекорация.Заголовок=СтрШаблон(Нстр("ru = '%1 %2'"),ДанныеТЧ.Синоним,ТекстСравнения);
	
	ЭлементТЧ_Стар.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Верх;
	ЭлементТЧ_Стар.Заголовок=СтрШаблон(Нстр("ru = '%1 (текущая)'"),ДанныеТЧ.Синоним);
		
	ОтобразитьИзменениеГруппыРодителя(ЭлементТЧ_Стар.Родитель);
	
КонецПроцедуры // ОтобразитьИзмененияТЧ()
	
Функция ПолучитьЭлементТЧ_Стар(Форма,ДанныеТЧ,РеквизитыТЧ)
	
	НоваяТЧ=Форма.Элементы.Добавить(ДанныеТЧ.ИмяТЧ,Тип("ТаблицаФормы"));
	НоваяТЧ.ПутьКДанным="Объект."+ДанныеТЧ.ИмяТЧ;
	НоваяТЧ.КоманднаяПанель.Видимость=Ложь;
	НоваяТЧ.Заголовок=ДанныеТЧ.Синоним;
	
	Для Каждого Строка ИЗ РеквизитыТЧ Цикл
		
		НоваяКолонка=Форма.Элементы.Добавить(ДанныеТЧ.ИмяТЧ+"_"+Строка.Имя,Тип("ПолеФормы"),НоваяТЧ);
		НоваяКолонка.ПутьКДанным="Объект."+ДанныеТЧ.ИмяТЧ+"."+Строка.Имя;
		НоваяКолонка.Заголовок=Строка.Синоним;
		НоваяКолонка.ТолькоПросмотр=Истина;
		
	КонецЦикла;
	
	Возврат НоваяТЧ; 
	
КонецФункции // ПолучитьЭлементТЧ_Стар() 

Процедура ОтобразитьИзменениеКонтактнойИнформации(Форма,СтрокаТЧ,ВидОперации)
	
	КонтактнаяИнформацияСтар = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов;
	КонтактнаяИнформацияНов = СтрокаТЧ.НовоеЗначение.Получить();
	
	ТаблицаЭлементов=Новый ТаблицаЗначений;	
	ТаблицаЭлементов.Колонки.Добавить("Элемент");
	ТаблицаЭлементов.Колонки.Добавить("Заголовок");
	ТаблицаЭлементов.Колонки.Добавить("НовоеЗначение");
	ТаблицаЭлементов.Колонки.Добавить("ПутьКДанным"); 
	
	РеквизитыКДобавлению=Новый Массив; 
		
	Для каждого СтрокаИнформация Из КонтактнаяИнформацияСтар Цикл
		
		ЗначениеСтар 	= Форма[СтрокаИнформация.ИмяРеквизита];
		ЭлементСтар		= Форма.Элементы[СтрокаИнформация.ИмяРеквизита];
		
		Заголовок=?(ЗначениеЗаполнено(ЭлементСтар.Заголовок),ЭлементСтар.Заголовок,Строка(СтрокаИнформация.Вид));
		
		МассивТипов=Новый Массив;
		МассивТипов.Добавить(ТипЗнч(ЗначениеСтар));
		
		РеквизитыКДобавлению.Добавить(Новый РеквизитФормы("New_"+СтрокаИнформация.ИмяРеквизита,Новый ОписаниеТипов(МассивТипов)));
	
		НайденныеСтроки = КонтактнаяИнформацияНов.НайтиСтроки(Новый Структура("Тип,Вид", СтрокаИнформация.Тип, СтрокаИнформация.Вид));
		
		Если НайденныеСтроки.Количество()=0 Тогда
			
			НовоеЗначение=Неопределено;
			
		Иначе
			
			НовоеЗначение=НайденныеСтроки[0].Представление;
			
		КонецЕсли;   
		
		Если (ЗначениеЗаполнено(ЗначениеСтар) ИЛИ ЗначениеЗаполнено(НовоеЗначение))
			И НЕ ЗначениеСтар=НовоеЗначение Тогда
			
			НоваяСтрока=ТаблицаЭлементов.Добавить();
			НоваяСтрока.Элемент=ЭлементСтар;
			НоваяСтрока.Заголовок=Заголовок;
			НоваяСтрока.НовоеЗначение=НовоеЗначение;
			НоваяСтрока.ПутьКДанным="New_"+СтрокаИнформация.ИмяРеквизита;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Форма.ИзменитьРеквизиты(РеквизитыКДобавлению);
	
	ТекстСравнения=?(ВидОперации=Перечисления.ВидыОперацийИзмененияНСИ.ИзменениеРеквизитовОбъекта,Нстр("ru = ' (новый)'"),Нстр("ru = ' (эталон)'"));
	
	ОтобразитьИзменениеЭлементов(Форма,ТаблицаЭлементов,ТекстСравнения); 
	
	Если НЕ Форма.Элементы.Найти("ГруппаЮрАдресДопДействия")=Неопределено Тогда
		
		Форма.Элементы.ГруппаЮрАдресДопДействия.Видимость=Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // ОтобразитьИзменениеКонтактнойИнформации()

Процедура ОтобразитьИзменениеДополнительныхРеквизитов(Форма,СтрокаТЧ,ВидОперации) Экспорт
	
	ДополнительныеРеквизитыСтар = Форма.Свойства_ОписаниеДополнительныхРеквизитов;
	ДополнительныеРеквизитыНов  = СтрокаТЧ.НовоеЗначение.Получить();
	
	ТаблицаЭлементов=Новый ТаблицаЗначений;	
	ТаблицаЭлементов.Колонки.Добавить("Элемент");
	ТаблицаЭлементов.Колонки.Добавить("Заголовок");
	ТаблицаЭлементов.Колонки.Добавить("НовоеЗначение");
	ТаблицаЭлементов.Колонки.Добавить("ПутьКДанным"); 
	
	РеквизитыКДобавлению=Новый Массив; 
		
	Для каждого СтрокаИнформация Из ДополнительныеРеквизитыСтар Цикл
		
		ЗначениеСтар 	= Форма[СтрокаИнформация.ИмяРеквизитаЗначение];
		ЭлементСтар		= Форма.Элементы[СтрокаИнформация.ИмяРеквизитаЗначение];
		
		Заголовок=?(ЗначениеЗаполнено(ЭлементСтар.Заголовок),ЭлементСтар.Заголовок,СтрокаИнформация.Наименование);
		
		МассивТипов=Новый Массив;
		МассивТипов.Добавить(ТипЗнч(ЗначениеСтар));
		
		РеквизитыКДобавлению.Добавить(Новый РеквизитФормы("New_"+СтрокаИнформация.ИмяРеквизитаЗначение,Новый ОписаниеТипов(МассивТипов)));
	
		НайденныеСтроки = ДополнительныеРеквизитыНов.НайтиСтроки(Новый Структура("Свойство", СтрокаИнформация.Свойство));
		
		Если НайденныеСтроки.Количество()=0 Тогда
			
			НовоеЗначение=СтрокаИнформация.ТипЗначения.ПривестиЗначение(Неопределено);
			
		Иначе
			
			НовоеЗначение=НайденныеСтроки[0].Значение;
			
		КонецЕсли;   
		
		Если (ЗначениеЗаполнено(ЗначениеСтар) ИЛИ ЗначениеЗаполнено(НовоеЗначение))
			И НЕ ЗначениеСтар=НовоеЗначение Тогда
			
			НоваяСтрока=ТаблицаЭлементов.Добавить();
			НоваяСтрока.Элемент=ЭлементСтар;
			НоваяСтрока.Заголовок=Заголовок;
			НоваяСтрока.НовоеЗначение=НовоеЗначение;
			НоваяСтрока.ПутьКДанным="New_"+СтрокаИнформация.ИмяРеквизитаЗначение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Форма.ИзменитьРеквизиты(РеквизитыКДобавлению);
	
	ТекстСравнения=?(ВидОперации=Перечисления.ВидыОперацийИзмененияНСИ.ИзменениеРеквизитовОбъекта,Нстр("ru = ' (новый)'"),Нстр("ru = ' (эталон)'"));
	
	ОтобразитьИзменениеЭлементов(Форма,ТаблицаЭлементов,ТекстСравнения); 
	
	
КонецПроцедуры // ОтобразитьИзменениеДополнительныхРеквизитов()

Процедура ОтобразитьИзменениеГруппыРодителя(ЭлементФормы)
	
	Если ТипЗнч(ЭлементФормы) = Тип("УправляемаяФорма") тогда
		
		Возврат
		
	ИначеЕсли ЭлементФормы.Видимость=Истина
		И ТипЗнч(ЭлементФормы)=Тип("ГруппаФормы")
		И (ЭлементФормы.Вид = ВидГруппыФормы.Страница ИЛИ 
			(ЭлементФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа И ЭлементФормы.Поведение=ПоведениеОбычнойГруппы.Свертываемая)) Тогда
			
			Если ЭлементФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа Тогда 
				
				ЭлементФормы.Подсказка = НСтр("ru='В группе находятся измененные реквизиты.'");
				ЭлементФормы.ЦветТекстаЗаголовка=WebЦвета.Красный;
				ЭлементФормы.ШрифтЗаголовка=Новый Шрифт(ЭлементФормы.ШрифтЗаголовка,,,Истина,,Истина);
				
			Иначе
				
				ЭлементФормы.Подсказка = НСтр("ru='На странице находятся измененные реквизиты.'");
				ЭлементФормы.Картинка = БиблиотекаКартинок.НовостиВнимание; 
				
			КонецЕсли;
			
		ОтобразитьИзменениеГруппыРодителя(ЭлементФормы.Родитель);
		
	Иначе 
		
		ОтобразитьИзменениеГруппыРодителя(ЭлементФормы.Родитель);		
		
	КонецЕсли;
	
КонецПроцедуры // ОтобразитьИзменениеРодителя() 

Процедура ПриСозданииНаСервереНСИ(Форма,Параметры) Экспорт
		
	Если Параметры.Свойство("АдресХранилищаИзменений") Тогда
		
		ОтобразитьИзмененияОбъекта(Форма,Параметры.АдресХранилищаИзменений);
		
	Иначе
					
		ДобавитьЭлементыУправленияНСИ(Форма);		
		
	КонецЕсли;
		
КонецПроцедуры // ПриСозданииНаСервереНСИ()

Функция КонтролироватьАктивность(Источник=Неопределено,МетаданныеОбъекта=Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ПолучитьФункциональнуюОпцию("УправлениеНСИ") Тогда
		
		Возврат Ложь;
		
	КонецЕсли; 

	Если МетаданныеОбъекта=Неопределено Тогда
		
		МетаданныеОбъекта = Источник.ПустаяСсылка().Метаданные();
		
	КонецЕсли;
	
	ДанныеОбъекта=УправлениеНСИ.ПолучитьДанныеОбъектаНСИ(МетаданныеОбъекта.Имя);	
	
	Если ДанныеОбъекта=Неопределено ИЛИ (НЕ ДанныеОбъекта.КонтролироватьАктивность) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции //

Функция ЭлементНСИНеАктивный(ЭлементСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(ЭлементСсылка) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("УправлениеНСИ") Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	МетаданныеОбъекта = ЭлементСсылка.Метаданные();
			
	ДанныеОбъекта=УправлениеНСИ.ПолучитьДанныеОбъектаНСИ(МетаданныеОбъекта.Имя);
	
	Если ДанныеОбъекта=Неопределено ИЛИ (НЕ ДанныеОбъекта.КонтролироватьАктивность) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСсылка,"НСИ_НеАктивный");
		
КонецФункции // ЭлементНСИНеАктивный()

Процедура ОбработкаПолученияФормыНСИОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	МетаданныеОбъекта=Неопределено;
	
	Если НЕ КонтролироватьАктивность(Источник,МетаданныеОбъекта) Тогда
		
		Возврат;
		
	КонецЕсли;
		
 	Если НЕ (ВидФормы = "ФормаВыбора") Тогда
		
		Возврат;
		
	КонецЕсли;
			
	ИмяФормыВыбора		= ПолучитьИмяФормыВыбора(МетаданныеОбъекта,ВидФормы);
	
	Если ИмяФормыВыбора=Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
		
	СтандартнаяОбработка = Ложь;
	
	ВыбраннаяФорма=ИмяФормыВыбора; 
	
	Если Параметры.Свойство("Отбор") Тогда
		
		Если НЕ Параметры.Свойство("НСИ_НеАктивный") Тогда
			
			Параметры.Отбор.Вставить("НСИ_НеАктивный",Ложь);
			
		КонецЕсли;
		
	Иначе
		
		Параметры.Вставить("Отбор",Новый Структура("НСИ_НеАктивный",Ложь));
		
	КонецЕсли;


КонецПроцедуры    

Функция ПолучитьИмяФормыВыбора(МетаданныеОбъекта,ВидФормы)
	
	Если ВидФормы = "ФормаВыбора" Тогда
				
		Возврат МетаданныеОбъекта.ОсновнаяФормаДляВыбора.Имя;
						
	ИначеЕсли ВидФормы = "ФормаВыбораГруппы" Тогда
					
		Возврат МетаданныеОбъекта.ОсновнаяФормаДляВыбораГруппы.Имя;
		
	Иначе
		
		Возврат Неопределено;
					
	КонецЕсли;
	
КонецФункции // ПолучитьФормуВыбора()

Процедура ОбработкаПолученияДанныхВыбораНСИОбработкаПолученияДанныхВыбора(Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	МетаданныеОбъекта=Неопределено;
	
	Если НЕ КонтролироватьАктивность(Источник,МетаданныеОбъекта) Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Если ТипЗнч(ДанныеВыбора)=Тип("СписокЗначений") Тогда
		
		СтандартнаяОбработка=Ложь;
		ДанныеВыбора=СформироватьРезультирующиеДанныеВыбора(МетаданныеОбъекта,ДанныеВыбора);
		
	Иначе
		
		Параметры.Отбор.Вставить("НСИ_НеАктивный",Ложь);
		
	КонецЕсли;
		
КонецПроцедуры 

Функция СформироватьРезультирующиеДанныеВыбора(МетаданныеОбъекта,ДанныеВыбора)
	
	СписокВыбора=Новый СписокЗначений;
	
	ТаблицаЭлементов=Новый ТаблицаЗначений;
	ТаблицаЭлементов.Колонки.Добавить("Ссылка");
	ТаблицаЭлементов.Колонки.Добавить("Элемент");
	
	МассивОтбора=Новый Массив;
		
	Для Индекс=0 ПО ДанныеВыбора.Количество()-1 Цикл
		
		Элемент=ДанныеВыбора[Индекс]; 
				
		Если ТипЗнч(Элемент.Значение)=Тип("Структура") Тогда
			
			Ссылка=Элемент.Значение.Значение;
			
		Иначе
			
			Ссылка=Элемент.Значение;
			
		КонецЕсли;
		
		НоваяСтрока=ТаблицаЭлементов.Добавить();
		НоваяСтрока.Ссылка=Ссылка;
		НоваяСтрока.Элемент=Элемент;
		
		МассивОтбора.Добавить(Ссылка);
		
	КонецЦикла;
			
	Запрос=Новый Запрос;
	ТекстЗапроса="ВЫБРАТЬ
	             |	Справочник.Ссылка КАК Ссылка
	             |ИЗ
	             |	&Параметр1 КАК Справочник
	             |ГДЕ
	             |	Справочник.Ссылка В(&МассивОтбора)
	             |	И НЕ Справочник.НСИ_НеАктивный"; 
	
	ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&Параметр1","Справочник."+МетаданныеОбъекта.Имя);
	
	Запрос.Текст=ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивОтбора",МассивОтбора);
	
	РабочаяТаблица=Запрос.Выполнить().Выгрузить();
	РабочаяТаблица.Индексы.Добавить("Ссылка");
	
	Для Индекс=0 По ТаблицаЭлементов.Количество()-1 Цикл
		
		ТекущееЗначение=ТаблицаЭлементов[Индекс];
		
		Если РабочаяТаблица.Найти(ТекущееЗначение.Ссылка,"Ссылка")=Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		СписокВыбора.Добавить(ТекущееЗначение.Элемент.Значение,ТекущееЗначение.Элемент.Представление,ТекущееЗначение.Элемент.Пометка,ТекущееЗначение.Элемент.Картинка);
		
	КонецЦикла;
	
	Возврат СписокВыбора;		
	
КонецФункции // СформироватьРезультирующиеДанныеВыбора() 

Процедура ПроверитьВозможностьСозданияОбъекта(Форма,Отказ) Экспорт
	
	СтруктураКонтроля=ДанныеКонтроляНСИ(Форма);
	
	Если НЕ (СтруктураКонтроля.КонтролироватьНСИ И СтруктураКонтроля.ТребуетсяСогласование) Тогда
		
		Возврат;
		
	КонецЕсли;
			
	Если СтруктураКонтроля.СуществующийОбъект Тогда
		
		Возврат;
		
	КонецЕсли;
	
	
КонецПроцедуры // ПроверитьВозможностьЗаписиОбъекта()

Процедура ОтобразитьСинонимыНаЯзыкеПользователя(Форма,ОписаниеРегистра=Ложь) Экспорт
		
	Если Метаданные.ОбщиеМодули.Найти("РаботаСОбъектамиМетаданныхУХ")=Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МодульРаботаСМетаданными=ОбщегоНазначения.ОбщийМодуль("РаботаСОбъектамиМетаданныхУХ");
	ПолеСиноним=МодульРаботаСМетаданными.ПолучитьПолеСиноним();
	
	Элементы=Форма.Элементы;
	
	Элементы.Синоним.Видимость=Ложь;
	
	НовыйЭлемент = Элементы.Вставить("ПолеСиноним",Тип("ПолеФормы"),Элементы.ГруппаОсновнойРаздел,Элементы.Владелец); // ПолеФормы
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Объект."+ПолеСиноним;
	НовыйЭлемент.Заголовок=НСтр("ru = 'Синоним'; en='Synonym'");
	
	Если НЕ ОписаниеРегистра Тогда
		
		ОтобразитьКолонкуСиноним(Элементы,"Реквизиты",ПолеСиноним);
		
	Иначе
		
		ОтобразитьКолонкуСиноним(Элементы,"Измерения",ПолеСиноним);
		ОтобразитьКолонкуСиноним(Элементы,"Ресурсы",ПолеСиноним);
		ОтобразитьКолонкуСиноним(Элементы,"Реквизиты",ПолеСиноним);
		
	КонецЕсли;	
			
КонецПроцедуры // ОтобразитьСинонимыНаЯзыкеПользователя() 

Процедура ОтобразитьКолонкуСиноним(Элементы,ИмяТаблицы,ПолеСиноним)
	
	ЭлементСиноним=Элементы[ИмяТаблицы+ПолеСиноним];
	
	Если ПолеСиноним="Синоним" Тогда
		
		Элементы[ИмяТаблицы+"Синоним1"].Видимость=Ложь;
		Элементы[ИмяТаблицы+"Синоним2"].Видимость=Ложь;
				
	ИначеЕсли ПолеСиноним="Синоним1" Тогда
		
		Элементы[ИмяТаблицы+"Синоним"].Видимость=Ложь;
		Элементы[ИмяТаблицы+"Синоним2"].Видимость=Ложь;
		
	ИначеЕсли ПолеСиноним="Синоним2" Тогда
		
		Элементы[ИмяТаблицы+"Синоним"].Видимость=Ложь;
		Элементы[ИмяТаблицы+"Синоним1"].Видимость=Ложь;
		
	КонецЕсли;
	
	ЭлементСиноним.Заголовок=НСтр("ru = 'Поле'; en='Field'");
		
КонецПроцедуры // ОтобразитьКолонкуСиноним() 

Функция КонтролироватьАктивностьМетаданные(МетаданныеОбъекта)
	
	РеквизитАктивности="НСИ_НеАктивный";
	
	Если НЕ МетаданныеОбъекта.Реквизиты.Найти(РеквизитАктивности)=Неопределено Тогда
		
		Возврат Истина;
		
	КонецЕсли; 
	
	Если Метаданные.ОбщиеРеквизиты.Найти(РеквизитАктивности)=Неопределено Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Метаданные.ОбщиеРеквизиты[РеквизитАктивности].Состав.Найти(МетаданныеОбъекта).Использование=Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать;
	
КонецФункции // КонтролироватьАктивностьМетаданные() 

Процедура ПолучитьМассивНеактивныхЭлементов(Объект,МассивНеактивныхЭлементов,МассивПроверенныхЭлементов)
	
	ТаблицаЭлементовНСИ=Новый ТаблицаЗначений;
	ТаблицаЭлементовНСИ.Колонки.Добавить("ТаблицаАналитики");
	ТаблицаЭлементовНСИ.Колонки.Добавить("Ссылка");
	
	МетаданныеОбъекта=Объект.Метаданные();
	
	РеквизитыОбъекта=УправлениеНСИ.ПолучитьСтруктуруРеквизитовОбъекта(МетаданныеОбъекта);	
	
	Если РеквизитыОбъекта.Количество()=0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МассивСправочников=Новый Массив;
	
	Для Каждого ИмяРеквизита ИЗ РеквизитыОбъекта.Реквизиты Цикл
		
		ЗначениеРеквизитаНСИ=Объект[ИмяРеквизита];
		
		ОбработатьЗначениеРеквизитаНСИ(ЗначениеРеквизитаНСИ,ТаблицаЭлементовНСИ,МассивСправочников,МассивПроверенныхЭлементов)
			
	КонецЦикла;
	
	Для Каждого ИмяТЧ ИЗ РеквизитыОбъекта.ТабличныеЧасти Цикл
		
		ДанныеТЧ=МетаданныеОбъекта.ТабличныеЧасти[ИмяТЧ];
		
		Для Каждого СтрокаТЧ ИЗ Объект[ИмяТЧ] Цикл
			
			Для Каждого РеквизитТЧ ИЗ ДанныеТЧ.Реквизиты Цикл
				
				ЗначениеРеквизитаНСИ=СтрокаТЧ[РеквизитТЧ.Имя];
				ОбработатьЗначениеРеквизитаНСИ(ЗначениеРеквизитаНСИ,ТаблицаЭлементовНСИ,МассивСправочников,МассивПроверенныхЭлементов)
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла; 
	
	ОбработатьПодчиненныеСправочники(Объект.Ссылка,РеквизитыОбъекта.ПодчиненныеСправочники,ТаблицаЭлементовНСИ,МассивСправочников,МассивПроверенныхЭлементов);
	
	ИмяФО="ИспользоватьПартнеровКакКонтрагентов";
	
	Если (НЕ Метаданные.ФункциональныеОпции.Найти(ИмяФО)=Неопределено)
		И ПолучитьФункциональнуюОпцию(ИмяФО)
		И Объект.Ссылка.Метаданные().Имя="Партнеры" Тогда
		
		ОбработатьКонтрагентовПартнера(Объект.Ссылка,ТаблицаЭлементовНСИ,МассивСправочников,МассивПроверенныхЭлементов); 
		
	КонецЕсли; 
	
	Если Объект.Ссылка.Метаданные().Имя="Организации" Тогда
				
		Если НЕ (Метаданные.Справочники.Найти("Контрагенты")=Неопределено 
			ИЛИ Метаданные.Справочники.Контрагенты.Реквизиты.Найти("ОрганизационнаяЕдиница")=Неопределено) Тогда
			
			ОбработатьКонтрагентовОрганизации(Объект.Ссылка,ТаблицаЭлементовНСИ,МассивСправочников,МассивПроверенныхЭлементов);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТаблицаЭлементовНСИ.Количество()>0 Тогда
		
		Запрос=Новый Запрос;
		ТекстЗапроса="";
		НомерПараметра=1;
		
		Для Каждого Строка ИЗ ТаблицаЭлементовНСИ Цикл
			
			ИмяПараметра="Параметр"+Формат(НомерПараметра,"ЧГ=0");
			
			ТекстЗапроса=ТекстЗапроса+"
			|ОБЪЕДИНИТЬ
			|ВЫБРАТЬ Ссылка
			|ИЗ "+Строка.ТаблицаАналитики+" КАК ТаблицаАналитики
			|ГДЕ ТаблицаАналитики.Ссылка=&"+ИмяПараметра+"
			|И ТаблицаАналитики.Ссылка.НСИ_НеАктивный";
			
			Запрос.УстановитьПараметр(ИмяПараметра,Строка.Ссылка);
			НомерПараметра=НомерПараметра+1;
			
		КонецЦикла;
		
		ТекстЗапроса=Сред(ТекстЗапроса,СтрДлина("ОБЪЕДИНИТЬ")+2);
		Запрос.Текст=ТекстЗапроса;
		
		Результат=Запрос.Выполнить().Выбрать();
		
		Пока Результат.Следующий() Цикл
			
			Если МассивНеактивныхЭлементов.Найти(Результат.Ссылка)=Неопределено Тогда
				
				МассивНеактивныхЭлементов.Добавить(Результат.Ссылка);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого ЭлементНСИ ИЗ МассивСправочников Цикл
		
		ПолучитьМассивНеактивныхЭлементов(ЭлементНСИ,МассивНеактивныхЭлементов,МассивПроверенныхЭлементов);
		
	КонецЦикла;
			
КонецПроцедуры // ПолучитьМассивНеактивныхОбъектов()

Процедура ОбработатьПодчиненныеСправочники(Владелец,ПодчиненныеСправочники,ТаблицаЭлементовНСИ,МассивСправочников,МассивПроверенныхЭлементов)

	Если ПодчиненныеСправочники.Количество()=0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекстЗапроса="";
	
	Для Каждого ИмяСправочника ИЗ ПодчиненныеСправочники Цикл
		
		ТекстЗапроса=ТекстЗапроса+"
		|ОБЪЕДИНИТЬ
		|ВЫБРАТЬ ТаблицаАналитики.Ссылка
		|ИЗ Справочник."+ИмяСправочника+" КАК ТаблицаАналитики
		|ГДЕ ТаблицаАналитики.Владелец=&Владелец";
		
	КонецЦикла; 
	
	Запрос=Новый Запрос;
	ТекстЗапроса=Сред(ТекстЗапроса,СтрДлина("ОБЪЕДИНИТЬ")+2);
	Запрос.Текст=ТекстЗапроса;
	Запрос.УстановитьПараметр("Владелец",Владелец);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		ОбработатьЗначениеРеквизитаНСИ(Результат.Ссылка,ТаблицаЭлементовНСИ,МассивСправочников,МассивПроверенныхЭлементов);
		
	КонецЦикла;
		
	
КонецПроцедуры // ОбработатьПодчиненныеСправочники()

Процедура ОбработатьКонтрагентовПартнера(Партнер,ТаблицаЭлементовНСИ,МассивСправочников,МассивПроверенныхЭлементов)
	
	Запрос=Новый Запрос;
	ТекстЗапроса="ВЫБРАТЬ
	             |	Контрагенты.Ссылка КАК Ссылка
	             |ИЗ
	             |	Справочник.Контрагенты КАК Контрагенты";
	
	ТекстЗапроса=ТекстЗапроса+"
	|ГДЕ Контрагенты.Партнер=&Партнер";
	
	Запрос.Текст=ТекстЗапроса;
	Запрос.УстановитьПараметр("Партнер",Партнер);
		
	Результат=Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		ОбработатьЗначениеРеквизитаНСИ(Результат.Ссылка,ТаблицаЭлементовНСИ,МассивСправочников,МассивПроверенныхЭлементов);
		
	КонецЦикла;
		
	
КонецПроцедуры // ОбработатьПодчиненныеСправочники()

Процедура ОбработатьКонтрагентовОрганизации(Организация,ТаблицаЭлементовНСИ,МассивСправочников,МассивПроверенныхЭлементов)
	
	Запрос=Новый Запрос;
	ТекстЗапроса="ВЫБРАТЬ
	             |	Контрагенты.Ссылка КАК Ссылка
	             |ИЗ
	             |	Справочник.Контрагенты КАК Контрагенты";
	
	ТекстЗапроса=ТекстЗапроса+"
	|ГДЕ Контрагенты.ОрганизационнаяЕдиница=&Организация";
	
	Запрос.Текст=ТекстЗапроса;
	Запрос.УстановитьПараметр("Организация",Организация);
		
	Результат=Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		ОбработатьЗначениеРеквизитаНСИ(Результат.Ссылка,ТаблицаЭлементовНСИ,МассивСправочников,МассивПроверенныхЭлементов);
		
	КонецЦикла;		
	
КонецПроцедуры // ОбработатьПодчиненныеСправочники()


Процедура ОбработатьЗначениеРеквизитаНСИ(ЗначениеРеквизитаНСИ,ТаблицаЭлементовНСИ,МассивСправочников,МассивПроверенныхЭлементов)

	Если НЕ (ЗначениеЗаполнено(ЗначениеРеквизитаНСИ) 
		И МассивПроверенныхЭлементов.Найти(ЗначениеРеквизитаНСИ)=Неопределено) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Не Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ЗначениеРеквизитаНСИ)) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МетаданныеРеквизита=ЗначениеРеквизитаНСИ.Метаданные(); 	
				
	Если НЕ КонтролироватьАктивностьМетаданные(МетаданныеРеквизита) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МассивСправочников.Добавить(ЗначениеРеквизитаНСИ);
	МассивПроверенныхЭлементов.Добавить(ЗначениеРеквизитаНСИ);
	
	НоваяСтрока=ТаблицаЭлементовНСИ.Добавить();
	НоваяСтрока.ТаблицаАналитики=МетаданныеРеквизита.ПолноеИмя();
	НоваяСтрока.Ссылка=ЗначениеРеквизитаНСИ;
	
КонецПроцедуры // ОбработатьЗначениеРеквизитаНСИ() 

Функция СогласовыватьСвязанныеОбъекты(Объект)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СправочникиБД.СогласованиеСвязанныхОбъектов КАК СогласованиеСвязанныхОбъектов
	|ИЗ
	|	Справочник.СправочникиБД КАК СправочникиБД
	|ГДЕ
	|	СправочникиБД.Владелец = ЗНАЧЕНИЕ(Справочник.ТипыБазДанных.ТекущаяИБ)
	|	И СправочникиБД.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование",Объект.Метаданные().Имя);
	Результат=Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	
	Возврат Результат.СогласованиеСвязанныхОбъектов=Перечисления.СпособыСогласованияСвязанныхОбъектов.СогласовыватьОтдельно
		ИЛИ Результат.СогласованиеСвязанныхОбъектов=Перечисления.СпособыСогласованияСвязанныхОбъектов.СогласовыватьСинхронно;
	
	
КонецФункции // СогласовыватьСвязанныеОбъекты() 

Функция ПолучитьЗаявкуНСИИзменение(АдресДанныхОбъекта) Экспорт 
	
	Перем СвязанныйОбъект;
	
	ДанныеВызова=ПолучитьИзВременногоХранилища(АдресДанныхОбъекта);
	
	Ссылка=ДанныеВызова.Ссылка;
	Объект=ДанныеВызова.Объект; 
	
	МассивНеактивныхЭлементов=Новый Массив;
	МассивПроверенныхЭлементов=Новый Массив;
	МассивПроверенныхЭлементов.Добавить(Ссылка);
	
	Если СогласовыватьСвязанныеОбъекты(Ссылка) Тогда
		
		ДанныеВызова.Свойство("СвязанныйОбъект",СвязанныйОбъект);
		
		Если Не СвязанныйОбъект=Неопределено Тогда
			
			МассивПроверенныхЭлементов.Добавить(СвязанныйОбъект);
			
		КонецЕсли;
				
		ПолучитьМассивНеактивныхЭлементов(Ссылка,МассивНеактивныхЭлементов,МассивПроверенныхЭлементов);
		
	КонецЕсли;
		
	Если  Ссылка.НСИ_НеАктивный    Тогда   //Если неактивный тогда открываем или создаем заявку на создание нового.
		
		Заявка = СуществуетРабочаяЗаявка(Ссылка,Перечисления.ВидыОперацийИзмененияНСИ.РегистрацияНовогоОбъекта);
		
		Если Заявка=Неопределено Тогда
			
			Возврат СоздатьЗаявкуНаИзменениеНСИ(Ссылка,
						Перечисления.ВидыОперацийИзмененияНСИ.РегистрацияНовогоОбъекта,
						Неопределено,МассивНеактивныхЭлементов,
						СвязанныйОбъект);			
			
		Иначе
			
			Возврат Заявка;
			
		КонецЕсли;
		
	Иначе
		
		Заявка = СуществуетРабочаяЗаявка(Ссылка,Перечисления.ВидыОперацийИзмененияНСИ.ИзменениеРеквизитовОбъекта);
				
		Если ВозможноИзменениеЗаявокНаИзменение(Заявка) Тогда  
			
			ТекстОшибки=УправлениеНСИ.ПроверитьКонтролируемыеРеквизитыОбъекта(Объект);
			
			Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
								
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки); 
				Возврат Неопределено;
				
			КонецЕсли;
			
			СтруктураИзменений=УправлениеНСИ.ПолучитьСтруктуруИзмененийОбъекта(ДанныеВызова);				
				
			
			Если СтруктураИзменений.Количество()=0 Тогда
				
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Реквизиты и табличные части, требующие согласования реквизитов, не изменены.
				|Заявка на изменение НСИ не требуется.'")); 
				Возврат Неопределено; 
				
			Иначе
				
				Возврат СоздатьЗаявкуНаИзменениеНСИ(Ссылка,
							Перечисления.ВидыОперацийИзмененияНСИ.ИзменениеРеквизитовОбъекта,
							СтруктураИзменений,
							МассивНеактивныхЭлементов,
							СвязанныйОбъект,Заявка);
				
			КонецЕсли;
			
		Иначе
			
			Возврат Заявка;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции 

Функция ВозможноИзменениеЗаявокНаИзменение(Заявка)

	Если Заявка=Неопределено Тогда
		
		Возврат Истина;
		
	Иначе
		
		ТекСостояниеЗаявки=УправлениеПроцессамиСогласованияУХ.ВернутьСтатусОбъекта(Заявка);
		
		Возврат ТекСостояниеЗаявки=Перечисления.СостоянияСогласования.Возвращена
			ИЛИ ТекСостояниеЗаявки=Перечисления.СостоянияСогласования.Отклонена;
		
	КонецЕсли;
	
	Возврат Ложь;		
	
КонецФункции // ВозможноИзменениеЗаявокНаИзменение()

Функция СоздатьЗаявкуНаИзменениеНСИ(Ссылка,
			ВидОперации,
			СтруктураИзменений=Неопределено,
			МассивНеактивныхЭлементов=Неопределено,
			СвязанныйОбъект=Неопределено,СуществующаяЗаявка=Неопределено)
	
	Если СуществующаяЗаявка=Неопределено Тогда		
		
		ТекЗаявка = Документы.ЗаявкаНаИзменениеНСИ.СоздатьДокумент();
		ТекЗаявка.Дата = ТекущаяДата();
		ТекЗаявка.ВидОперации=ВидОперации; 
		ТекЗаявка.ТипОбъектаКонсолидации="Справочник";
		ИмяОбъектаМетаданных = Ссылка.Метаданные().Имя;
		ТекЗаявка.СправочникБД = Справочники.СправочникиБД.НайтиПоНаименованию(ИмяОбъектаМетаданных,,,Справочники.ТипыБазДанных.ТекущаяИБ);
		ТекЗаявка.Ответственный=Пользователи.ТекущийПользователь();
		
		ТекЗаявка.ИзменяемыйОбъект=Ссылка; 
		
		Если ВидОперации=Перечисления.ВидыОперацийИзмененияНСИ.УдалениеДубликатаОбъекта
			ИЛИ ВидОперации=Перечисления.ВидыОперацийИзмененияНСИ.УдалениеОбъекта Тогда
			
			ТекЗаявка.Записать();
			
			Возврат ТекЗаявка.Ссылка;
			
		КонецЕсли; 
		
	Иначе
		
		ТекЗаявка=СуществующаяЗаявка.ПолучитьОбъект();
		
	КонецЕсли;
		
	Если НЕ СтруктураИзменений=Неопределено Тогда
		
		Если СтруктураИзменений.Свойство("ИзменениеРеквизитов") Тогда
			
			ТекЗаявка.ИзменениеРеквизитов.Загрузить(СтруктураИзменений.ИзменениеРеквизитов);
			
		КонецЕсли; 
		
		Если СтруктураИзменений.Свойство("ИзменениеТЧ") Тогда
			
			ТекЗаявка.ИзменениеТЧ.Загрузить(СтруктураИзменений.ИзменениеТЧ);
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если НЕ МассивНеактивныхЭлементов=Неопределено Тогда
		
		Для Каждого ЭлементНСИ ИЗ МассивНеактивныхЭлементов Цикл
			
			СвязаннаяЗаявка = СуществуетРабочаяЗаявка(ЭлементНСИ,Перечисления.ВидыОперацийИзмененияНСИ.РегистрацияНовогоОбъекта);
			
			Если СвязаннаяЗаявка=Неопределено Тогда
				
				СвязаннаяЗаявка= СоздатьЗаявкуНаИзменениеНСИ(ЭлементНСИ,Перечисления.ВидыОперацийИзмененияНСИ.РегистрацияНовогоОбъекта);			
				
			КонецЕсли;
			
			НоваяСтрока=ТекЗаявка.ЗаявкиНаИзменениеСвязанныхОбъектов.Добавить();
			НоваяСтрока.ЗаявкаНаСвязанныйОбъект=СвязаннаяЗаявка;
			
		КонецЦикла;
		
	КонецЕсли; 
	
	Если Не СвязанныйОбъект=Неопределено Тогда
		
		СвязаннаяЗаявка=СуществуетРабочаяЗаявка(СвязанныйОбъект);
		
		Если Не СвязаннаяЗаявка=Неопределено Тогда 
			
			Если ТекЗаявка.ЗаявкиНаИзменениеСвязанныхОбъектов.Найти(СвязаннаяЗаявка,"ЗаявкаНаСвязанныйОбъект")=Неопределено Тогда
				
				НоваяСтрока=ТекЗаявка.ЗаявкиНаИзменениеСвязанныхОбъектов.Добавить();
				НоваяСтрока.ЗаявкаНаСвязанныйОбъект=СвязаннаяЗаявка; 
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
				
	ТекЗаявка.Записать();
	
	Возврат ТекЗаявка.Ссылка; 
		
КонецФункции // ПолучитьЗаявкуНаИзменениеНСИ() 

Функция ПолучитьЗаявкуНСИУдаление(Ссылка) Экспорт 
		
	Если  Ссылка.НСИ_НеАктивный    Тогда   //Если неактивный, тогда нет необходимости удалять через заявку
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Элемент еще не зарегистрирован,
		|заявка на удаление элемента не требуется.'"));
		Возврат Неопределено;
	
	Иначе 
		
		Заявка = СуществуетРабочаяЗаявка(Ссылка,Перечисления.ВидыОперацийИзмененияНСИ.УдалениеОбъекта);
		
		Если Заявка=Неопределено Тогда
			
			Возврат СоздатьЗаявкуНаИзменениеНСИ(Ссылка,Перечисления.ВидыОперацийИзмененияНСИ.УдалениеОбъекта);
			
		Иначе
			
			Возврат Заявка;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции 

Функция ПолучитьЗаявкуНСИУдалениеДубликата(Ссылка) Экспорт 
	
	Заявка = СуществуетРабочаяЗаявка(Ссылка,Перечисления.ВидыОперацийИзмененияНСИ.УдалениеДубликатаОбъекта);
	
	Если Заявка=Неопределено Тогда
		
		Возврат СоздатьЗаявкуНаИзменениеНСИ(Ссылка,Перечисления.ВидыОперацийИзмененияНСИ.УдалениеДубликатаОбъекта);
		
	Иначе
		
		Возврат Заявка;
		
	КонецЕсли;
	
КонецФункции

Функция СуществуетРабочаяЗаявка(Ссылка,ВидОперации=Неопределено) Экспорт
	
	ВнешнееСогласованиеНСИ=ВнешнееУправлениеНСИ(Ссылка);
	
	Если ВнешнееСогласованиеНСИ Тогда
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		             |	СоответствиеЗаявокНаИзменениеНСИ.Состояние КАК Состояние,
		             |	СоответствиеЗаявокНаИзменениеНСИ.ЗаявкаЦентральнаяБаза КАК ЗаявкаЦентральнаяБаза,
		             |	СоответствиеЗаявокНаИзменениеНСИ.ЗаявкаДочерняяБаза КАК ЗаявкаДочерняяБаза
		             |ПОМЕСТИТЬ УтвержденныеЗаявки
		             |ИЗ
		             |	РегистрСведений.СоответствиеЗаявокНаИзменениеНСИ КАК СоответствиеЗаявокНаИзменениеНСИ
		             |ГДЕ
		             |	СоответствиеЗаявокНаИзменениеНСИ.ЗаявкаДочерняяБаза.ИзменяемыйОбъект = &ИзменяемыйОбъект
		             |	И СоответствиеЗаявокНаИзменениеНСИ.Состояние = &СостояниеУтверждена
		             |	И НЕ СоответствиеЗаявокНаИзменениеНСИ.ЗаявкаДочерняяБаза.ПометкаУдаления
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ ПЕРВЫЕ 1
		             |	ЗаявкаНаИзменениеНСИ.Ссылка КАК Ссылка
		             |ИЗ
		             |	Документ.ЗаявкаНаИзменениеНСИ КАК ЗаявкаНаИзменениеНСИ
		             |ГДЕ
		             |	ЗаявкаНаИзменениеНСИ.ИзменяемыйОбъект = &ИзменяемыйОбъект
		             |	И НЕ ЗаявкаНаИзменениеНСИ.ПометкаУдаления
		             |	И НЕ ЗаявкаНаИзменениеНСИ.Ссылка В
		             |				(ВЫБРАТЬ
		             |					УтвержденныеЗаявки.ЗаявкаДочерняяБаза
		             |				ИЗ
		             |					УтвержденныеЗаявки)";
		
		Запрос.УстановитьПараметр("ИзменяемыйОбъект",Ссылка);
		Запрос.УстановитьПараметр("СостояниеУтверждена", Перечисления.СостоянияСогласования.Утверждена);
		  		
		Результат=Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда
			
			Возврат Результат.Ссылка;
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;		
		
	Иначе
		
		Если Метаданные.ОбщиеМодули.Найти("ДействияСогласованиеУХСервер") <> Неопределено Тогда
			
			МодульДействияСогласование= ОбщегоНазначения.ОбщийМодуль("ДействияСогласованиеУХСервер"); 
			Возврат МодульДействияСогласование.СуществуетРабочаяЗаявка(Ссылка,ВидОперации);
			
		КонецЕсли
		
	КонецЕсли;
	
	Возврат Неопределено;
						
КонецФункции 

Процедура НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта(Форма,СогласованиеВнешняяИБ) Экспорт
	
	Если СогласованиеВнешняяИБ Тогда
		
		ПодготовитьФормуЗаявки(Форма);
		
	ИначеЕсли Метаданные.ОбщиеМодули.Найти("ДействияСогласованиеУХСервер") <> Неопределено Тогда
		
		МодульДействияСогласование= ОбщегоНазначения.ОбщийМодуль("ДействияСогласованиеУХСервер"); 
		МодульДействияСогласование.НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта(Форма);
		
	КонецЕсли;	
	
КонецПроцедуры // НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта()

Процедура ПодготовитьФормуЗаявки(Форма)
		
	ОписаниеТиповСтроки=РаботаСОбъектамиМетаданныхВнешнийУХ.ПолучитьОписаниеТиповСтроки(50);
	ОписаниеТиповСостояние=РаботаСОбъектамиМетаданныхВнешнийУХ.ПолучитьОписаниеТиповСсылка("ПеречислениеСсылка.СостоянияСогласования");
	
	МассивДобавления = Новый Массив;
	МассивДобавления.Добавить(Новый РеквизитФормы("Согласующий",ОписаниеТиповСтроки,"",НСтр("ru = 'Согласующий'")));
	МассивДобавления.Добавить(Новый РеквизитФормы("СтатусОбъекта",ОписаниеТиповСостояние,"",НСтр("ru = 'Статус объекта'")));
    МассивДобавления.Добавить(Новый РеквизитФормы("СостояниеЗаявки",ОписаниеТиповСтроки,"",НСтр("ru = 'Состояние'")));
	Форма.ИзменитьРеквизиты(МассивДобавления);
	
	ОпределитьСостояниеВнешнееСогласование(Форма);
	НарисоватьПанельСогласованияЗаявки(Форма);	
		
КонецПроцедуры // ПодготовитьФормуЗаявки() 

Процедура НарисоватьПанельСогласованияЗаявки(Форма) Экспорт
	
	Если НЕ Форма.СтатусОбъекта=Перечисления.СостоянияСогласования.Черновик Тогда
						
		ДобавитьКомандуФормыЦНСИ(Форма,"ИсторияСогласования",НСтр("ru = 'История согласования'"),"ИсторияСогласования_Подключаемый","ИсторияСогласованияНСИ",Форма.Элементы.ГруппаВнешнееСогласование);	
		ДобавитьКомандуФормыЦНСИ(Форма,"МаршрутСогласования",НСтр("ru = 'Ход согласования'"),"МаршрутСогласования_Подключаемый","СхемаПроцесса",Форма.Элементы.ГруппаВнешнееСогласование);
		
		НовыйЭлемент = Форма.Элементы.Вставить("КартинкаСтатуса", Тип("ДекорацияФормы"), Форма.Элементы.ГруппаВнешнееСогласование,Форма.Элементы.ГруппаВнешнееСогласование.ПодчиненныеЭлементы[0]); // 
		НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
		
		ДанныеСостояния=ПолучитьДанныеОтображенияСостояния(Форма.СтатусОбъекта);
		НовыйЭлемент.Картинка=ДанныеСостояния.ТекущаяКартинка;
		НовыйЭлемент.Подсказка=ДанныеСостояния.ТекущаяПодсказка;
	
		Если Форма.СтатусОбъекта=Перечисления.СостоянияСогласования.НаУтверждении
			ИЛИ Форма.СтатусОбъекта=Перечисления.СостоянияСогласования.Утверждена Тогда 
			
			Форма.ПоложениеКоманднойПанели=ПоложениеКоманднойПанелиФормы.Нет;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры // НарисоватьПанельСогласованияЗаявки()

Процедура ПодготовитьЗаявкуКПередаче(ЗаявкаСсылка,ОбменДаннымиРегламентнымЗаданием)

	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ЗаявкаНаИзменениеНСИ.Ссылка КАК Ссылка,
	             |	ЗаявкаНаИзменениеНСИ.СправочникБД.ЦентрализованнаяБазаНСИ КАК ЦентрализованнаяБазаНСИ,
	             |	ЗаявкаНаИзменениеНСИ.Номер КАК Номер,
	             |	ЗаявкаНаИзменениеНСИ.Дата КАК Дата,
	             |	ЗаявкаНаИзменениеНСИ.СправочникБД.ЦентрализованнаяБазаНСИ.ТипБД.ОбменДаннымиРегламентнымЗаданием КАК ОбменДаннымиРегламентнымЗаданием
	             |ИЗ
	             |	Документ.ЗаявкаНаИзменениеНСИ КАК ЗаявкаНаИзменениеНСИ
	             |ГДЕ
	             |	ЗаявкаНаИзменениеНСИ.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",ЗаявкаСсылка); 
	
	Результат=Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	
	НаборЗаписей=РегистрыСведений.СоответствиеЗаявокНаИзменениеНСИ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаявкаДочерняяБаза.Установить(ЗаявкаСсылка); 
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество()=0 Тогда
		
		СтрокаЗаявка=НаборЗаписей.Добавить();
		СтрокаЗаявка.ЗаявкаДочерняяБаза			= ЗаявкаСсылка;
		СтрокаЗаявка.ЗаявкаДочерняяБазаНомер	= Результат.Номер;
		СтрокаЗаявка.ЗаявкаДочерняяБазаДата		= Результат.Дата;
		СтрокаЗаявка.ЦентрализованнаяБазаНСИ	= Результат.ЦентрализованнаяБазаНСИ;
		
	Иначе
		
		СтрокаЗаявка=НаборЗаписей[0];
		СтрокаЗаявка.ОбменВыполнен=Ложь;
		СтрокаЗаявка.Состояние=Перечисления.СостоянияСогласования.ПустаяСсылка();
		
	КонецЕсли;
		
	НаборЗаписей.Записать(); 
	
	ОбменДаннымиРегламентнымЗаданием=Результат.ОбменДаннымиРегламентнымЗаданием;
		
КонецПроцедуры // ПодготовитьДанныеКПередаче() 

Процедура ПодготовитьСвязанныеЗаявкиКПередаче(ЗаявкаСсылка,МассивЗаявок)

	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ЗаявкиНаИзменениеСвязанныхОбъектов.ЗаявкаНаСвязанныйОбъект КАК Ссылка,
	|	ЗаявкиНаИзменениеСвязанныхОбъектов.Ссылка.СправочникБД.ЦентрализованнаяБазаНСИ КАК ЦентрализованнаяБазаНСИ,
	|	ЗаявкиНаИзменениеСвязанныхОбъектов.ЗаявкаНаСвязанныйОбъект.Номер КАК Номер,
	|	ЗаявкиНаИзменениеСвязанныхОбъектов.ЗаявкаНаСвязанныйОбъект.Дата КАК Дата
	|ИЗ
	|	Документ.ЗаявкаНаИзменениеНСИ.ЗаявкиНаИзменениеСвязанныхОбъектов КАК ЗаявкиНаИзменениеСвязанныхОбъектов
	|ГДЕ
	|	ЗаявкиНаИзменениеСвязанныхОбъектов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",ЗаявкаСсылка); 
	
	Результат=Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		
		НаборЗаписей=РегистрыСведений.СоответствиеЗаявокНаИзменениеНСИ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЗаявкаДочерняяБаза.Установить(Результат.Ссылка); 
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество()=0 Тогда
			
			СтрокаЗаявка=НаборЗаписей.Добавить();
			СтрокаЗаявка.ЗаявкаДочерняяБаза			= Результат.Ссылка;
			СтрокаЗаявка.ЗаявкаДочерняяБазаНомер	= Результат.Номер;
			СтрокаЗаявка.ЗаявкаДочерняяБазаДата		= Результат.Дата;
			СтрокаЗаявка.ЦентрализованнаяБазаНСИ	= Результат.ЦентрализованнаяБазаНСИ;
			СтрокаЗаявка.ЗаявкаРодитель				= XMLСтрока(ЗаявкаСсылка);
			
		Иначе
			
			СтрокаЗаявка=НаборЗаписей[0];
			СтрокаЗаявка.ОбменВыполнен=Ложь;
			СтрокаЗаявка.Состояние=Перечисления.СостоянияСогласования.ПустаяСсылка();
			
		КонецЕсли;
		
		НаборЗаписей.Записать();	
		МассивЗаявок.Добавить(Результат.Ссылка);
		
	КонецЦикла;
		
КонецПроцедуры // ПодготовитьДанныеКПередаче()

Процедура ПринятьКСогласованию(ЗаявкаСсылка) Экспорт
	
	ОбменДаннымиРегламентнымЗаданием=Ложь;
	
	МассивЗаявок=Новый Массив;
	МассивЗаявок.Добавить(ЗаявкаСсылка);
	
	ПодготовитьСвязанныеЗаявкиКПередаче(ЗаявкаСсылка,МассивЗаявок);
	ПодготовитьЗаявкуКПередаче(ЗаявкаСсылка,ОбменДаннымиРегламентнымЗаданием);
		
	Если НЕ ОбменДаннымиРегламентнымЗаданием Тогда
		
		УправлениеНСИ.ВыгрузитьСсылкиЗаявокНаИзменениеНСИ(МассивЗаявок);
		
	КонецЕсли;
	
КонецПроцедуры // ПринятьКСогласованию()

Процедура ОпределитьСостояниеЗаявки(Форма, ОбновитьОтветственныхВход = Ложь,СогласованиеВнешняяИБ) Экспорт

	Если СогласованиеВнешняяИБ Тогда 
		
		ОпределитьСостояниеВнешнееСогласование(Форма);	
		
	ИначеЕсли Метаданные.ОбщиеМодули.Найти("МодульУправленияПроцессамиУХ") <> Неопределено Тогда
		
		МодульУправленияПроцессами= ОбщегоНазначения.ОбщийМодуль("МодульУправленияПроцессамиУХ"); 
		МодульУправленияПроцессами.ОпределитьСостояние(Форма, ОбновитьОтветственныхВход);
		
	КонецЕсли;
		
КонецПроцедуры 

Процедура ОпределитьСостояниеВнешнееСогласование(Форма)
	
	ДокументСсылка=Форма.Объект.Ссылка;
	ТекСтатусОбъекта=Перечисления.СостоянияСогласования.Черновик;
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
			
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	СоответствиеЗаявокНаИзменениеНСИ.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.СоответствиеЗаявокНаИзменениеНСИ КАК СоответствиеЗаявокНаИзменениеНСИ
		|ГДЕ
		|	СоответствиеЗаявокНаИзменениеНСИ.ЗаявкаДочерняяБаза = &ЗаявкаДочерняяБаза";
		
		Запрос.УстановитьПараметр("ЗаявкаДочерняяБаза",ДокументСсылка);
		
		Результат=Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() 
			И ЗначениеЗаполнено(Результат.Состояние) Тогда
			
			ТекСтатусОбъекта=Результат.Состояние;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Форма.СтатусОбъекта=ТекСтатусОбъекта;	
	
КонецПроцедуры // ОпределитьСостояниеВнешнееСогласование() 

// Возвращает картинку для графического отображения состояния процесса СостояниеВход.
Функция ПолучитьДанныеОтображенияСостояния(СостояниеВход) Экспорт
	
	ТекущаяКартинка = БиблиотекаКартинок.ПометкаНовостиФлагКонтур;
	ТекущаяПодсказка=НСтр("ru = 'Черновик'");
	
	Если СостояниеВход = Перечисления.СостоянияСогласования.НаУтверждении Тогда
		
		ТекущаяКартинка = БиблиотекаКартинок.ПометкаНовостиФлагСиний;
		ТекущаяПодсказка=НСтр("ru = 'На утверждении'");

	ИначеЕсли СостояниеВход = Перечисления.СостоянияСогласования.Отклонена Тогда	
		
		ТекущаяКартинка = БиблиотекаКартинок.ПометкаНовостиФлагКрасный;
		ТекущаяПодсказка=НСтр("ru = 'Отклонена'");
	
	ИначеЕсли СостояниеВход = Перечисления.СостоянияСогласования.Возвращена Тогда	
		
		ТекущаяКартинка = БиблиотекаКартинок.ПометкаНовостиФлагЖелтый;
		ТекущаяПодсказка=НСтр("ru = 'Возвращена'");
		
	ИначеЕсли СостояниеВход = Перечисления.СостоянияСогласования.Утверждена  Тогда	
		
		ТекущаяКартинка = БиблиотекаКартинок.ПометкаНовостиФлагЗеленый;
		ТекущаяПодсказка=НСтр("ru = 'Утверждена'");
		
	КонецЕсли;	
	
	Возврат Новый Структура("ТекущаяКартинка,ТекущаяПодсказка",ТекущаяКартинка,ТекущаяПодсказка);

КонецФункции		// ПолучитьКартинкуОтображенияПроцесса()
